---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Profile1Angle
source: html/d7db5717-d520-d998-8089-d54d3469beba.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Profile1Angle Property

"Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId Profile1Angle { get; }
```